#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaReplayBrowserMatchStats

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaReplayBrowserMatchStats.AthenaReplayBrowserMatchStats_C.ExecuteUbergraph_AthenaReplayBrowserMatchStats
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayBrowserMatchStats_C_ExecuteUbergraph_AthenaReplayBrowserMatchStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAthenaReplayBrowserRowProxyInstance*   K2Node_CustomEvent_ReplayInfo;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function AthenaReplayBrowserMatchStats.AthenaReplayBrowserMatchStats_C.Refresh
// 0x01E8 (0x01E8 - 0x0000)
struct AthenaReplayBrowserMatchStats_C_Refresh final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue4;              // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue5;              // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue6;              // 0x00E8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue7;              // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue8;              // 0x0118(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue9;              // 0x0130(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue10;             // 0x0168(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue11;             // 0x0198(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x01D0(0x0018)()
};

// Function AthenaReplayBrowserMatchStats.AthenaReplayBrowserMatchStats_C.SetReplayInfo
// 0x0008 (0x0008 - 0x0000)
struct AthenaReplayBrowserMatchStats_C_SetReplayInfo final
{
public:
	class UAthenaReplayBrowserRowProxyInstance*   ReplayInfo_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

