#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00A8 (0x2558 - 0x24B0)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x24B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x24B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x2508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x250C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250D[0x3];                                     // 0x250D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x2510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x2518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x2520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2521[0x7];                                     // 0x2521(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x2528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x2530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x2538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetParachuting;                              // 0x2539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetSkydiving;                                // 0x253A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253B[0x5];                                     // 0x253B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x2540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x2548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2549[0x7];                                     // 0x2549(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x2550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	void Looping_Audio_Update();
	void Handle_Parachute_Audio_State();
	void On_Pause_State_Changed(bool bPaused);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void _Speedup_Loops(float Playback_Multiplier);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class USoundBase* GetSkydivingSound();
	void SetSkydivingAudioEnabled(bool Enabled);
	void IsGameplayCamera(bool* IsGameplayCamera_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplayPC_Athena_C">();
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};

}

