#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_RCRocket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_RCRocket.GA_Athena_RCRocket_C
// 0x0068 (0x09A0 - 0x0938)
class UGA_Athena_RCRocket_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AB_PrjPawn_Athena_RCRocket_C*           SpawnedRocket;                                     // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PlayerPawn;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GT_EventWeaponFire;                                // 0x0950(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GT_EventWeaponFire_RCRocket;                       // 0x0958(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AController*                            PawnsController;                                   // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_968[0x8];                                      // 0x0968(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             Transform;                                         // 0x0970(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_RCRocket(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Validate_RC_Pawn(class AB_PrjPawn_Athena_RCRocket_C* RCPawn);
	void Update_Ignore_Move_and_Turn_Input(class AController* InController, bool Ignore);

	void GetAthenaPlayerController(class AFortPlayerControllerAthena** AsFort_Player_Controller_Athena) const;
	void GetAthenaPlayerPawn(class AFortPlayerPawnAthena** AsFort_Player_Pawn_Athena) const;
	void CalculateRocketSpawnLocation(struct FTransform* Transform_0) const;
	struct FVector Calculate_Launch_Right_Adjustment() const;
	struct FVector Calculate_Launch_Up_Adjustment() const;
	struct FVector Calculate_Launch_Forward_Adjustment() const;
	void Adjust_Location_For_Vehicle(class AFortPlayerPawn* Pawn, const struct FVector& InLocation, struct FVector* OutLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_RCRocket_C">();
	}
	static class UGA_Athena_RCRocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_RCRocket_C>();
	}
};

}

