#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HeroSquadManagementScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroSquadManagementScreen.HeroSquadManagementScreen_C
// 0x0060 (0x04D8 - 0x0478)
class UHeroSquadManagementScreen_C final : public UFortHeroSquadManagementScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Entrance;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AniShowSlotInfo;                                   // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HidePicker;                                        // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AniHideSlotInfo;                                   // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowPicker;                                        // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderSlotInfo;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeaderWithNav_C*                       HeaderWithNav;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSlotBody;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSlotHeader;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputBackAction;                                   // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_HeroSquadManagementScreen(int32 EntryPoint);
	void BndEvt__HeaderWithNav_K2Node_ComponentBoundEvent_0_BackButtonPressed__DelegateSignature();
	void OnBeginIntro();
	void BndEvt__SquadSlotsView_K2Node_ComponentBoundEvent_2_OnDifferentSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void HandleSquadSlotPickerHidden();
	void HandleSquadSlotPickerShown();
	void OnDeactivated();
	void SetDefaultScroll();
	void Construct();
	void OnActivated();
	ESlateVisibility GetInZoneVisibility();
	void HandleClosePicker(bool* bPassThrough);
	void ShowSlotInfo(const class FText& HeaderText, const class FText& BodyText);
	void HideSlotInfo();
	void Update_Hero_Squad_Bonus_Tiles_SubIcon_Glow_State();
	void Update_Hero_Squad_Bonus_Highlight_State();
	void HandleHideSlotInfoAni();
	void HandlePickerHideAni();
	void HandlePickerShowAni();
	void HandleShowSlotInfoAni();
	void Intro();
	void Intro_Initial_Reset();
	void UpdateSquadSlotInfoPanel(int32 SquadSlotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroSquadManagementScreen_C">();
	}
	static class UHeroSquadManagementScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroSquadManagementScreen_C>();
	}
};

}

