#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemManagementScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementScreen.ItemManagementScreen_C
// 0x00A0 (0x0510 - 0x0470)
class UItemManagementScreen_C final : public UFortItemManagementScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCraftingBar_C*                         CraftingBar;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortniteDefaultBackgroundBlurWidget_C* FortniteDefaultBackgroundBlurWidget;               // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Inventory;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Screen;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ItemDragEnabled;                                   // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortItemManagementItemTileButton*      SelectedTileButton;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuantitySelector_C*                    QuantitySelectorWidget;                            // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WarningShownReadOnlyWIFE;                          // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             StorageTransferSound;                              // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EFortFrontendInventoryFilter, EFrontEndCamera> InventoryFilterToCameraMap;                  // 0x04C0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ItemManagementScreen(int32 EntryPoint);
	void HandleCraftAndSlotItemBP(class UFortSchematicItem* SchematicItem, EFortItemTier RequestedTier);
	void HandleOpenCraftingOptionsBP(class UFortSchematicItem* SchematicItem);
	void HandleInspectItemBP(class UFortItem* Item);
	void Construct();
	void HandleFilterChangeViaHeader(int32 InIndex);
	void RefreshScreenAfterFilterChange();
	void ShowWarningReadOnlyWIFE(bool Force);
	void HandleMulchQuantitySelection(class UFortItem* Item);
	void HandleDropItemBP(class UFortItem* Item);
	void HandleTransferItemBP(class UFortItem* Item);
	void HandleConsumeItemBP(class UFortConsumableAccountItem* ConsumableItem);
	void OnActivated();
	void DefaultActionRefresh();
	void HandleCraftItemBP(class UFortSchematicItem* SchematicItem, EFortItemTier RequestedTier);
	void HandleEquipItemBP(class UFortItem* Item);
	void HandleDifferentItemManagementModeSetBP();
	void DialogResult_CDD8108541BE3E4EA0F093B03D59650F(EFortDialogResult Result, class FName ResultName);
	void OnMCPRequestComplete_D020DD864A3EFC9A31973C87076269CA();
	void DialogResult_EF030FF4438BB62E1CCFDFBCCE5EFA40(EFortDialogResult Result, class FName ResultName);
	void HandleClose();
	void HandleInspect(class UFortItem* ItemToInspect);
	void GetDescriptionText(class FText* ItemDescription);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void SizeInventoryPanel();
	void HandleEquip(class UFortItem* Item);
	void CraftAndSlotInternal(class UFortSchematicItem* SchematicItem, EFortItemTier RequestedTier);
	void ShowCraftError(EFortCraftFailCause FailCause);
	void HandleTransfer(class UFortItem* ItemToTransfer);
	void CreateQuantitySelector(class UFortItem* Item, const class FText& Title, const class FText& ConfirmText, int32 InitialQuantity, int32 MaxQuantity);
	void HandleTransferItemsCallback(int32 Quantity, class UFortItem* Item);
	void CompleteItemTransfer(class UFortItem* Item, int32 Quantity);
	void HandleDrop(class UFortItem* Item);
	void HandleDropItemsCallback(int32 Quantity, class UFortItem* Item);
	void CompleteItemDrop(class UFortItem* Item, int32 Quantity);
	void HandleMulchItemsCallback(int32 Quantity, class UFortItem* Item);
	void IsEquipAvailable(class UFortItem* Item, bool* EquipAvailable);
	void SizeScreen();
	void GuardActionForReadOnlyWIFE(bool* Proceed);
	void ToggleTileSize();
	void TogglePrioritizeFavorites();
	void GetShouldPrioritizeFavorites(bool* SortFavoritesSeparately);
	void HandleDifferentModeSet();
	void SetHeaderIndex();

	void GetMaxTransferCount(class UFortItem* Item, int32* Count) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementScreen_C">();
	}
	static class UItemManagementScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementScreen_C>();
	}
};

}

