#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemManagementDetailsModeBox

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C
// 0x0030 (0x0388 - 0x0358)
class UItemManagementDetailsModeBox_C final : public UFortItemDetailsModeActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   DetailPanelTabList;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemSelected;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NoSelectionDetailsBox;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDateTime                              LastDesiredReadOnlyModeWIFE;                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortItemManagementViewPopup_C*         ItemManagementViewPopup;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemManagementDetailsModeBox(int32 EntryPoint);
	void OnInitialized();
	void HandleCraftItemFailed(EFortCraftFailCause FailureCause);
	void OnDestroyItem(class UFortItem* Item);
	void OnInputModeChanged(bool bUsingGamepad);
	void OnDeactivated();
	void BndEvt__DetailPanelTabList_MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void HandleConsumeItemProgressChangedBP();
	void BndEvt__DetailPanelTabList_OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__DetailPanelTabList_OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__DetailPanelTabList_OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnActivated();
	void HandleDifferentItemToDetailSetBP();
	void BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void DialogResult_4190138B4388B0E2F8396BBD395808D5(EFortDialogResult Result, class FName ResultName);
	void DialogResult_475B18A9452A639A04116D83A8B1CC22(EFortDialogResult Result, class FName ResultName);
	void HandleBack(bool* PassThrough);
	void HandleInspect(bool* PassThrough);
	void HandleCompare(bool* PassThrough);
	void HandleMulch(bool* PassThrough);
	void HandleSort(bool* PassThrough);
	void TrySetupInputHandling();
	void HandleConsumeItem(bool* PassThrough);
	void HandleCraft(bool* PassThrough);
	void ShowSelection();
	void HandleDrop(bool* PassThrough);
	void RegisterDropOrDestroy();
	void RegisterCraft();
	void RegisterMulch();
	void RegisterRetire();
	void RegisterInspect();
	void RegisterBack();
	void RegisterSort(bool InGame);
	void RegisterConsumeItem();
	void RegisterCompare();
	void RegisterTrack();
	void HandleTrack(bool* PassThrough);
	void RegisterEquip();
	void HandleEquip(bool* PassThrough);
	void SetupDetailPanels();
	void RefreshConsumeAction();
	void SetItemVisualization();
	void SetTabStyling(class UObject* Object);
	void RegisterInventoryInspect();
	void HandleWorldItemListChanged(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved);
	void HandleWorldItemsChanged();
	void RefreshCraftActions();
	void RefreshMulchAction();
	void RegisterLeaveInventory();
	void HandleQuickbarContentsChanged(EFortQuickBars QuickbarIndex, TArray<int32>& ChangedSlots);
	void RegisterInspectUpgrade();
	void RegisterTransferActions();
	void HandleTransfer(bool* PassThrough);
	void RefreshTransferActions();
	void UnbindEvents();
	void HandleSwitchPanel(bool* PassThrough);
	void RefreshSwitchPanelAction();
	void HandleWithdrawAll(bool* PassThrough);
	void HandleDestroy(bool* PassThrough);
	void RegisterMore();
	void HandleMore(bool* Pass_Through);
	void PreferReadOnlyWIFE(bool* ReadOnly);
	void UpdateReadOnlyWIFE();
	void RefreshDestroyAction();
	void RegisterOpenCustomFilter();
	void HandleOpenCustomFilter(bool* PassThrough);
	void GetStatsTabVisibility(ESlateVisibility* StatsTabVisbility);
	void MulchQuestComplete(bool* QuestComplete);
	void GetItemManagementViewPopup(class UFortItemManagementViewPopup_C** AsFort_Item_Management_View_Popup);
	void HandleCraftingOptions(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementDetailsModeBox_C">();
	}
	static class UItemManagementDetailsModeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementDetailsModeBox_C>();
	}
};

}

