#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemTransformItemPicker

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransformItemPicker.ItemTransformItemPicker_C
// 0x0060 (0x0290 - 0x0230)
class UItemTransformItemPicker_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   FilterTabList;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotItemPicker_C*         ItemTransformSlotItemPicker;                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainModeItemDetailsHostPanel_C*        MainModeItemDetailsHostPanel;                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnItemSelected;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFortItemTransformFilterTabLabelInfo> FilterTabs;                                  // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<class UFortItem*>                      SacrificeItems;                                    // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   CurrentTab;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentlySelectedSlot;                             // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemTransformItemPicker(int32 EntryPoint);
	void Construct();
	void BndEvt__FilterTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void PreConstruct(bool IsDesignTime);
	void SetupItemPicker();
	void HandleItemSelected(class UFortItem* Item);
	void RemoveInvalidItems(TArray<class UFortAccountItem*>& UnrefinedItems, TArray<class UFortItem*>& CurrentSacrificeItems, TArray<class UFortAccountItem*>* RefinedItems);
	void HandleItemCommitted(class UFortItem* Item);
	void SetupFilterTabList();
	void SetFilter(class FName FilterName);
	void OpenPicker(TArray<class UFortItem*>& SacrificeItems_0, int32 SelectedSlot);
	void CommitSelectedItem(bool* PassThru);
	void OpenInspectionScreen(bool* PassThru);
	void Return_Item_to_Detail(class UFortItem* InItem, class UFortItem** OutItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransformItemPicker_C">();
	}
	static class UItemTransformItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransformItemPicker_C>();
	}
};

}

