#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint.M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C
// 0x1FE0 (0x23B0 - 0x03D0)
class UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4D083CFB43E11F85A96087A218BB7BAE; // 0x03D8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1872ACF04C46FFA045FC69B4A8A5BE74; // 0x03F8(0x00D0)(ContainsInstancedReference)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_DA7F616742A73676682DFE962C7A9097; // 0x04D0(0x0310)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7DB76C3F48F97D8CF7DFB98F3C0DF756; // 0x07E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F250A6D64C5D0DFA740D4AA5A241B6D7; // 0x0800(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_68C7555B4952C826BD5E4CB53F095FA7; // 0x0820(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8651B63E4AA91C51A815929C08C3C559; // 0x0B30(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_EFFE8AEA4DD194B52BCE94B3662DE607; // 0x0E40(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_38FA54CC43BC1C1D2C4408A8C09F82E6; // 0x1150(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A5E507C9415604E9DAE77683DBC92AE0; // 0x1460(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8C4AA5B641FE517FCA350DB5D1932FE4; // 0x1770(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_01EDC5964A42C785313443AE90C2EA31; // 0x1A80(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B78997D142A0D1CF2837DF888BDB7B06; // 0x1D90(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A0C97E4A46266B7CFE56A7BC1B12FC7C; // 0x20A0(0x0310)()

public:
	void ExecuteUbergraph_M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C">();
	}
	static class UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C>();
	}
};

}

