#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SK_Military_M202_Launcher_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Military_M202_Launcher_AnimBP.SK_Military_M202_Launcher_AnimBP_C
// 0x05F8 (0x0860 - 0x0268)
class USK_Military_M202_Launcher_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_17CF37A94A2C7AC4053A03A9139BF1E7; // 0x0278(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_E162F90747951BA3BEDA4896DEED9E40; // 0x0298(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_B765535648D151547097BEA864D8C8D4; // 0x02E0(0x0540)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_43CF7C314AA3EFEE15AD1687FA14E458; // 0x0820(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_68F46D374AA96ADBF7D82B82DA19EDA7; // 0x0840(0x0020)()

public:
	void ExecuteUbergraph_SK_Military_M202_Launcher_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Military_M202_Launcher_AnimBP_C">();
	}
	static class USK_Military_M202_Launcher_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Military_M202_Launcher_AnimBP_C>();
	}
};

}

