#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: XpBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass XpBar.XpBar_C
// 0x0028 (0x0250 - 0x0228)
class UXpBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_3;                                         // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBarNew;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Xp_Bar_Material;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoNotShowBoostFills;                               // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_XpBar(int32 EntryPoint);
	void Destruct();
	void Xp_Boost_Changed(int32 BoostAmount);
	void Account_Info_Changed(const struct FFortPublicAccountInfo& NewInfo);
	void Construct();
	void Update_Xp_Bar(const struct FFortPublicAccountInfo& Account_Info);
	class UWidget* GetExperienceToolTipWidget();
	int32 ScaledBoostBalance(int32 AmountToLevel);
	int32 ScaledRestBalance(int32 AmountToLevel);
	float ScaledCommanderBalance(int32 LeveXP, int32 InInt2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XpBar_C">();
	}
	static class UXpBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpBar_C>();
	}
};

}

