#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: XpBoostQuantitiesIndicator

#include "Basic.hpp"

#include "XPTypeEnum_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass XpBoostQuantitiesIndicator.XpBoostQuantitiesIndicator_C
// 0x0028 (0x0258 - 0x0230)
class UXpBoostQuantitiesIndicator_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BoostColor;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_BoostType;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextNormalXPQuant;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EXPTypeEnum                                   XPType;                                            // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_XpBoostQuantitiesIndicator(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Xp_Boost_Changed(int32 BoostAmount);
	void HandleAccountUpdate(const struct FFortPublicAccountInfo& NewInfo);
	void Construct();
	int32 ScaledBoostBalance(int32 AmountToLevel);
	int32 ScaledRestBalance(int32 AmountToLevel);
	void Update(EXPTypeEnum inBoostType);
	void IsMaxed(bool* MaxReached);
	void GetXpValues(int32* XpNeededToNextLevel, int32* Earned, int32* Boosted, int32* DailyBonus, bool* MaxLevelReached);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XpBoostQuantitiesIndicator_C">();
	}
	static class UXpBoostQuantitiesIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpBoostQuantitiesIndicator_C>();
	}
};

}

